case.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-12-03 Tue 12:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pricing Deposit Insurance</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Pricing Deposit Insurance</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org67e034a">1. Overview</a></li>
<li><a href="#org201a0f2">2. Deposit Insurance</a></li>
<li><a href="#org3f89f23">3. Option Pricing Model</a>
<ul>
<li><a href="#org527d7bb">3.1. Original Black-Scholes-Merton Model</a></li>
<li><a href="#orgdccc9ef">3.2. Margrabe Spread Option Model</a></li>
</ul>
</li>
<li><a href="#org1fdf8cf">4. Data</a></li>
<li><a href="#orga50ce05">5. Python Implementation</a></li>
<li><a href="#org944a103">6. References</a></li>
</ul>
</div>
</div>


<div id="outline-container-org67e034a" class="outline-2">
<h2 id="org67e034a"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
Merton (1977) used option pricing methods to value deposit insurance.
</p>
</div>
</div>


<div id="outline-container-org201a0f2" class="outline-2">
<h2 id="org201a0f2"><span class="section-number-2">2</span> Deposit Insurance</h2>
<div class="outline-text-2" id="text-2">
<p>
Banks deposits are insured by the Federal Deposit Insurance Corporation (FDIC).
</p>
</div>
</div>

<div id="outline-container-org3f89f23" class="outline-2">
<h2 id="org3f89f23"><span class="section-number-2">3</span> Option Pricing Model</h2>
<div class="outline-text-2" id="text-3">
<p>
Let \(D\) and \(A\) stand for the value of the bank's deposits and assets.  Then the payment to the bank be the deposit insurer is \(max(D - V, 0)\).  That is, if the value of the banks assets are less than the deposits, then the insurer must pay:
</p>

<p>
\[D - V\]
</p>

<p>
However if the bank's assets exceed deposits then the insurer pays \$0.
</p>
</div>

<div id="outline-container-org527d7bb" class="outline-3">
<h3 id="org527d7bb"><span class="section-number-3">3.1</span> Original Black-Scholes-Merton Model</h3>
</div>

<div id="outline-container-orgdccc9ef" class="outline-3">
<h3 id="orgdccc9ef"><span class="section-number-3">3.2</span> Margrabe Spread Option Model</h3>
</div>
</div>



<div id="outline-container-org1fdf8cf" class="outline-2">
<h2 id="org1fdf8cf"><span class="section-number-2">4</span> Data</h2>
<div class="outline-text-2" id="text-4">
<p>
Extract only Granville Bank. 
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">import</span> pandas <span style="color: #4f97d7; font-weight: bold;">as</span> pd

<span style="color: #7590db;">data</span> = pd.read_csv<span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"callreports_final.csv"</span><span style="color: #4f97d7;">)</span>

<span style="color: #7590db;">data</span> = data<span style="color: #4f97d7;">[</span>data.rssdid == 560830<span style="color: #4f97d7;">]</span>

<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>data.shape<span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span>data<span style="color: #4f97d7;">)</span>
</pre>
</div>

<pre class="example">
(152, 167)
        rssdid  chartertype  ...  intincreloans  dividendoncommonstock
804718  560830          200  ...            NaN                    NaN
804719  560830          200  ...            NaN                    NaN
804720  560830          200  ...            NaN                    NaN
804721  560830          200  ...            NaN                    NaN
804722  560830          200  ...            NaN                    NaN
...        ...          ...  ...            ...                    ...
804865  560830          200  ...          168.0                   17.0
804866  560830          200  ...          157.0                   15.0
804867  560830          200  ...          158.0                   15.0
804868  560830          200  ...          157.0                   16.0
804869  560830          200  ...          159.0                   16.0

[152 rows x 167 columns]
</pre>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">print</span><span style="color: #4f97d7;">(</span><span style="color: #2d9574;">"hello world"</span><span style="color: #4f97d7;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga50ce05" class="outline-2">
<h2 id="orga50ce05"><span class="section-number-2">5</span> Python Implementation</h2>
<div class="outline-text-2" id="text-5">
<p>
Below is a function which will calculate the latest cost of deposit insurance for a given bank.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #4f97d7; font-weight: bold;">def</span> <span style="color: #bc6ec5; font-weight: bold;">get_cost</span><span style="color: #4f97d7;">(</span>idrssd<span style="color: #4f97d7;">)</span>:
<span style="background-color: #292e34;"> </span>   <span style="color: #9f8766;">"""calculate the value of deposit insurance for a given bank using the approach of Merton (1977)""""</span>
<span style="color: #9f8766; background-color: #292e34;"> </span><span style="color: #9f8766;">   ## first calculate asset volatility </span>



</pre>
</div>
</div>
</div>



<div id="outline-container-org944a103" class="outline-2">
<h2 id="org944a103"><span class="section-number-2">6</span> References</h2>
<div class="outline-text-2" id="text-6">
<p>
@article{merton1977analytic,
  title={An analytic derivation of the cost of deposit insurance and loan guarantees an application of modern option pricing theory},
  author={Merton, Robert C},
  journal={Journal of Banking \&amp; Finance},
  volume={1},
  number={1},
  pages={3&#x2013;11},
  year={1977},
  publisher={Elsevier}
}
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida</p>
<p class="date">Created: 2019-12-03 Tue 12:30</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
